tests/Functional/Request/Factory/__data__/check_cwu_request.xml

<?xml version="1.0"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://xml.kamsoft.pl/ws/common" xmlns:brok="http://xml.kamsoft.pl/ws/broker" xmlns:ewus="https://ewus.nfz.gov.pl/ws/broker/ewus/status_cwu/v5">
 <soapenv:Header>
  <com:session id="sessionId"/>
  <com:authToken id="token"/>
 </soapenv:Header>
 <soapenv:Body>
  <brok:executeService>
   <com:location>
    <com:namespace>nfz.gov.pl/ws/broker/cwu</com:namespace>
    <com:localname>checkCWU</com:localname>
    <com:version>5.0</com:version>
   </com:location>
   <brok:date>2020-11-28T08:59:29+00:00</brok:date>
   <brok:payload>
    <brok:textload>
     <ewus:status_cwu_pyt>
      <ewus:numer_pesel>11111111111</ewus:numer_pesel>
      <system_swiad nazwa="gilek/ewus" wersja="&lt;VERSION&gt;"/>
     </ewus:status_cwu_pyt>
    </brok:textload>
   </brok:payload>
  </brok:executeService>
 </soapenv:Body>
</soapenv:Envelope>
