xml_templates/executeService.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:com="http://xml.kamsoft.pl/ws/common" xmlns:brok="http://xml.kamsoft.pl/ws/broker">
  <soapenv:Header>
    <com:session xmlns:ns1="http://xml.kamsoft.pl/ws/common" />
    <com:authToken xmlns:ns1="http://xml.kamsoft.pl/ws/common" />
  </soapenv:Header>
  <soapenv:Body>
    <brok:executeService>
      <com:location>
        <com:namespace>nfz.gov.pl/ws/broker/cwu</com:namespace>
        <com:localname>checkCWU</com:localname>
        <com:version>5.0</com:version>
      </com:location>
      <brok:payload>
        <brok:textload>
          <ewus:status_cwu_pyt xmlns:ewus="https://ewus.nfz.gov.pl/ws/broker/ewus/status_cwu/v5">
            <ewus:numer_pesel />
            <ewus:system_swiad nazwa="client-eWUS" wersja="1.0.0" />
          </ewus:status_cwu_pyt>
        </brok:textload>
      </brok:payload>
    </brok:executeService>
  </soapenv:Body>
</soapenv:Envelope>